app/controllers/notes_controller.rb

  def create
    puts "================="
    puts  current_user.email
    puts "================="
    @note = Note.new(note_params)
    @note.user = current_user.email
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("title", "text", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "werw"], ["text", "werw"], ["user", "laubla@gmail.com"], ["created_at", "2021-07-03 15:19:33.868408"], ["updated_at", "2021-07-03 15:19:33.868408"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["text", "werwj"], ["updated_at", "2021-08-25 17:50:13.938954"], ["id", 1]]